Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q21.xml
      <value-group caption="" name="AFEC_MR__SLEEP">
        <value caption="Normal mode: The AFE and reference voltage circuitry are kept ON between conversions." name="NORMAL" value="0"/>
        <value caption="Sleep mode: The AFE and reference voltage circuitry are OFF between conversions." name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__FWUP">
        <value caption="Normal Sleep mode: The sleep mode is defined by the SLEEP bit." name="OFF" value="0"/>
        <value caption="Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__FREERUN">
        <value caption="Normal mode" name="OFF" value="0"/>
        <value caption="Free Run mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__STARTUP">
        <value caption="0 periods of AFE clock" name="SUT0" value="0x0"/>
        <value caption="8 periods of AFE clock" name="SUT8" value="0x1"/>
        <value caption="16 periods of AFE clock" name="SUT16" value="0x2"/>
        <value caption="24 periods of AFE clock" name="SUT24" value="0x3"/>
        <value caption="64 periods of AFE clock" name="SUT64" value="0x4"/>
        <value caption="80 periods of AFE clock" name="SUT80" value="0x5"/>
        <value caption="96 periods of AFE clock" name="SUT96" value="0x6"/>
        <value caption="112 periods of AFE clock" name="SUT112" value="0x7"/>
        <value caption="512 periods of AFE clock" name="SUT512" value="0x8"/>
        <value caption="576 periods of AFE clock" name="SUT576" value="0x9"/>
        <value caption="640 periods of AFE clock" name="SUT640" value="0xA"/>
        <value caption="704 periods of AFE clock" name="SUT704" value="0xB"/>
        <value caption="768 periods of AFE clock" name="SUT768" value="0xC"/>
        <value caption="832 periods of AFE clock" name="SUT832" value="0xD"/>
        <value caption="896 periods of AFE clock" name="SUT896" value="0xE"/>
        <value caption="960 periods of AFE clock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="AFEC_MR__USEQ">
        <value caption="Normal mode: The controller converts channels in a simple numeric order." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="AFEC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_EMR__RES">
        <value caption="12-bit resolution, AFE sample rate is maximum (no averaging)." name="NO_AVERAGE" value="0x0"/>
        <value caption="13-bit resolution, AFE sample rate divided by 4 (averaging)." name="OSR4" value="0x2"/>
        <value caption="14-bit resolution, AFE sample rate divided by 16 (averaging)." name="OSR16" value="0x3"/>
        <value caption="15-bit resolution, AFE sample rate divided by 64 (averaging)." name="OSR64" value="0x4"/>
        <value caption="16-bit resolution, AFE sample rate divided by 256 (averaging)." name="OSR256" value="0x5"/>
      </value-group>
      <value-group caption="" name="AFEC_EMR__SIGNMODE">
        <value caption="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: Unsigned conversions." name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: Signed conversions." name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_TEMPMR__TEMPCMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFEC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" version="6417ZB">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
