Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q21.xml
        <register caption="Screening Type 1 Register Priority Queue  (index = 0) 1" name="GMAC_ST1RPQ1" offset="0x504" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type 1 Register Priority Queue  (index = 0) 2" name="GMAC_ST1RPQ2" offset="0x508" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type 1 Register Priority Queue  (index = 0) 3" name="GMAC_ST1RPQ3" offset="0x50C" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 0" name="GMAC_ST2RPQ0" offset="0x540" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 1" name="GMAC_ST2RPQ1" offset="0x544" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 2" name="GMAC_ST2RPQ2" offset="0x548" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 3" name="GMAC_ST2RPQ3" offset="0x54C" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 4" name="GMAC_ST2RPQ4" offset="0x550" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
        <register caption="Screening Type 2 Register Priority Queue  (index = 0) 5" name="GMAC_ST2RPQ5" offset="0x554" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="VLAN Priority" mask="0x00000070" name="VLANP"/>
          <bitfield caption="VLAN Enable" mask="0x00000100" name="VLANE"/>
          <bitfield caption="Index of Screening Type 2 EtherType register x" mask="0x00000E00" name="I2ETH"/>
          <bitfield caption="EtherType Enable" mask="0x00001000" name="ETHE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x0003E000" name="COMPA"/>
          <bitfield caption="Compare A Enable" mask="0x00040000" name="COMPAE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x00F80000" name="COMPB"/>
          <bitfield caption="Compare B Enable" mask="0x01000000" name="COMPBE"/>
          <bitfield caption="Index of Screening Type 2 Compare Word 0/Word 1 register x" mask="0x3E000000" name="COMPC"/>
          <bitfield caption="Compare C Enable" mask="0x40000000" name="COMPCE"/>
        </register>
