Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70Q21.xml
        <register caption="Peripheral Clock Disable Register 1" name="PMC_PCDR1" offset="0x0104" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Disable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Disable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 37 Disable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 39 Disable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Disable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Disable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Disable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Disable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Disable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Disable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Disable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Disable" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Disable" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Disable" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Disable" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Disable" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 52 Disable" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral Clock 53 Disable" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral Clock 56 Disable" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Disable" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Disable" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Disable" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Disable" mask="0x10000000" name="PID60"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_PCSR1" offset="0x0108" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Status" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Status" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Status" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Status" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Status" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Status" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 52 Status" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral Clock 53 Status" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral Clock 56 Status" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Status" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Status" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Status" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Status" mask="0x10000000" name="PID60"/>
        </register>
        <register caption="Peripheral Control Register" name="PMC_PCR" offset="0x010C" rw="RW" size="4">
          <bitfield caption="Peripheral ID" mask="0x0000003F" name="PID"/>
          <bitfield caption="Command" mask="0x00001000" name="CMD"/>
          <bitfield caption="Divisor Value" mask="0x00030000" name="DIV" values="PMC_PCR__DIV"/>
          <bitfield caption="Enable" mask="0x10000000" name="EN"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR" offset="0x0110" rw="RW" size="4">
          <bitfield caption="RC Oscillator Calibration bits for 4 MHz" mask="0x0000007F" name="CAL4"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 4 MHz" mask="0x00000080" name="SEL4"/>
          <bitfield caption="RC Oscillator Calibration bits for 8 MHz" mask="0x00007F00" name="CAL8"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 8 MHz" mask="0x00008000" name="SEL8"/>
          <bitfield caption="RC Oscillator Calibration bits for 12 MHz" mask="0x007F0000" name="CAL12"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 12 MHz" mask="0x00800000" name="SEL12"/>
        </register>
        <register caption="SleepWalking Enable Register 0" name="PMC_SLPWK_ER0" offset="0x0114" rw="W" size="4">
          <bitfield caption="Peripheral 7 SleepWalking Enable" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral 8 SleepWalking Enable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 SleepWalking Enable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 SleepWalking Enable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 SleepWalking Enable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 SleepWalking Enable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 SleepWalking Enable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 SleepWalking Enable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 SleepWalking Enable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 SleepWalking Enable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 SleepWalking Enable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 SleepWalking Enable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 SleepWalking Enable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 SleepWalking Enable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 SleepWalking Enable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 SleepWalking Enable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 SleepWalking Enable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 SleepWalking Enable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 SleepWalking Enable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 SleepWalking Enable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 SleepWalking Enable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 SleepWalking Enable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 SleepWalking Enable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral 30 SleepWalking Enable" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral 31 SleepWalking Enable" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="SleepWalking Disable Register 0" name="PMC_SLPWK_DR0" offset="0x0118" rw="W" size="4">
          <bitfield caption="Peripheral 7 SleepWalking Disable" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral 8 SleepWalking Disable" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 SleepWalking Disable" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 SleepWalking Disable" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 SleepWalking Disable" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 SleepWalking Disable" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 SleepWalking Disable" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 SleepWalking Disable" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 SleepWalking Disable" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 SleepWalking Disable" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 SleepWalking Disable" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 SleepWalking Disable" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 SleepWalking Disable" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 SleepWalking Disable" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 SleepWalking Disable" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 SleepWalking Disable" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 SleepWalking Disable" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 SleepWalking Disable" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 SleepWalking Disable" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 SleepWalking Disable" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 SleepWalking Disable" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 SleepWalking Disable" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 SleepWalking Disable" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral 30 SleepWalking Disable" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral 31 SleepWalking Disable" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="SleepWalking Status Register 0" name="PMC_SLPWK_SR0" offset="0x011C" rw="R" size="4">
          <bitfield caption="Peripheral 7 SleepWalking Status" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral 8 SleepWalking Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 SleepWalking Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 SleepWalking Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 SleepWalking Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 SleepWalking Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 SleepWalking Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 SleepWalking Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 SleepWalking Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 SleepWalking Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 SleepWalking Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 SleepWalking Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 SleepWalking Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 SleepWalking Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 SleepWalking Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 SleepWalking Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 SleepWalking Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 SleepWalking Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 SleepWalking Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 SleepWalking Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 SleepWalking Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 SleepWalking Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 SleepWalking Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral 30 SleepWalking Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral 31 SleepWalking Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="SleepWalking Activity Status Register 0" name="PMC_SLPWK_ASR0" offset="0x0120" rw="R" size="4">
          <bitfield caption="Peripheral 7 Activity Status" mask="0x00000080" name="PID7"/>
          <bitfield caption="Peripheral 8 Activity Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral 9 Activity Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral 10 Activity Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral 11 Activity Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral 12 Activity Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral 13 Activity Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral 14 Activity Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral 15 Activity Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral 16 Activity Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral 17 Activity Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral 18 Activity Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral 19 Activity Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral 20 Activity Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral 21 Activity Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral 22 Activity Status" mask="0x00400000" name="PID22"/>
          <bitfield caption="Peripheral 23 Activity Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral 24 Activity Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral 25 Activity Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral 26 Activity Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral 27 Activity Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral 28 Activity Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral 29 Activity Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral 30 Activity Status" mask="0x40000000" name="PID30"/>
          <bitfield caption="Peripheral 31 Activity Status" mask="0x80000000" name="PID31"/>
        </register>
